2016/scripts/notes.org
#+TITLE: Red Hat OpenStack Platform - Swift
#+DATE: May 18, 2016
#+OPTIONS: texht:t
#+OPTIONS: toc:nil email:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER_EXTRA:
#+LaTeX_HEADER: \usepackage[a4paper, total={6in, 10in}]{geometry}
#+LaTeX_HEADER: \usepackage[utf8]{inputenc}
#+LaTeX_HEADER: \usepackage[english]{babel}

#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{emacs}

#+LaTeX_HEADER: \renewcommand{\familydefault}{\rmdefault}
#+LaTeX_HEADER: \usepackage[usenames, dvipsnames]{xcolor}
#+LaTeX_HEADER: \pagenumbering{arabic}
#+LaTeX_HEADER: \usepackage{hyperref}
#+LaTeX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan}
#+LaTeX_HEADER: \urlstyle{same}

** Theory
   - Swift allows users to store unstructured data(objects) with
     canonical names containing /three/ part:
      - =/account=: Think =account= as a storage location and NOT user
        account. =account= stores meta-data of that account, plus list
        of all containers in that account. =account= is analogous to
        =/home= directory which may holds multiple users.

      - =/account/container=: Think of container as a root directory
        of user(analogous to =/home/<USER>/=). Account can have many
        containers with no limit.

      - =/account/container/object=: This is actual file. User may
        start storing a single file(files are stored in container as
        an object), or hierarchical data like \newline
        =/photos/alaska/magic-bus/me.jpg= as an object. Swift stores
        multiple copies of single object across physical locations to
        ensure the data reliability and availability.

   - Remember that, user do not have to know the actual location of the
     data. In-fact he never knows. User always access the data in the
     form of =/account/container/object=.

