2016/scripts/notes.tex
% Created 2016-11-15 Tue 12:23
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper, total={6in, 10in}]{geometry}
\usepackage[utf8]{inputenc}
\usepackage[english]{babel}
\usepackage{minted}
\usemintedstyle{emacs}
\renewcommand{\familydefault}{\rmdefault}
\usepackage[usenames, dvipsnames]{xcolor}
\pagenumbering{arabic}
\usepackage{hyperref}
\hypersetup{colorlinks=true, linkcolor=blue, filecolor=magenta, urlcolor=cyan}
\urlstyle{same}
\author{Sachin\thanks{psachin@redhat.com}}
\date{May 18, 2016}
\title{Red Hat OpenStack Platform - Swift}
\hypersetup{
 pdfauthor={Sachin},
 pdftitle={Red Hat OpenStack Platform - Swift},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 8.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Theory}
\label{sec:orgheadline1}
\begin{itemize}
\item Swift allows users to store unstructured data(objects) with
canonical names containing \emph{three} part:
\begin{itemize}
\item \texttt{/account}: Think \texttt{account} as a storage location and NOT user
account. \texttt{account} stores meta-data of that account, plus list
of all containers in that account. \texttt{account} is analogous to
\texttt{/home} directory which may holds multiple users.

\item \texttt{/account/container}: Think of container as a root directory
of user(analogous to \texttt{/home/<USER>/}). Account can have many
containers with no limit.

\item \texttt{/account/container/object}: This is actual file. User may
start storing a single file(files are stored in container as
an object), or hierarchical data like \newline
\texttt{/photos/alaska/magic-bus/me.jpg} as an object. Swift stores
multiple copies of single object across physical locations to
ensure the data reliability and availability.
\end{itemize}

\item Remember that, user do not have to know the actual location of the
data. In-fact he never knows. User always access the data in the
form of \texttt{/account/container/object}.
\end{itemize}
