2016/scripts/notes.tex

\section{Handy commands}
\label{sec:orgheadline2}
\begin{itemize}
\item \emph{My settings}:
\begin{itemize}
\item Swift server IP address: \hfill \texttt{192.168.8.80:8080}
\item AuthURL: \hfill \texttt{http://192.168.8.80:8080/auth/v1.0}
\item PublicURL/StorageURL: \hfill \texttt{http://192.168.8.80:8080/v1/AUTH\_wasteland}
\item account: \hfill \texttt{wasteland}
\item container: \hfill \texttt{keys}
\item object: \hfill \texttt{mykey.pem}
\end{itemize}

\item If you have access to Swift server, \texttt{Pubic-URL/StorageURL},
\texttt{Auth-Token}, \& \texttt{account} can be fetched using following command,
\begin{minted}[]{sh}
swift stat -v
#                     StorageURL: http://192.168.8.80:8080/v1/AUTH_wasteland
#                     Auth Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
#                        Account: AUTH_wasteland
#                     Containers: 0
#                        Objects: 0
#                          Bytes: 0
# Containers in policy "default": 1
#    Objects in policy "default": 0
#      Bytes in policy "default": 0
#                  Accept-Ranges: bytes
#                    X-Timestamp: 1463138224.81309
#                     X-Trans-Id: tx1fe3ecbeb9f04fdc92287-005735e92c
#                   Content-Type: text/plain; charset=utf-8
\end{minted}

\vskip15ex

\item New user can be added as follows,
\begin{minted}[]{sh}
# --- /etc/swift/proxy-server.conf ---
[filter:tempauth]
use = egg:swift#tempauth
# user_ACCOUNT_USER = PASSWORD [GROUP] <storage URL:8080>
user_wasteland_psachin = psachin .admin .reseller_admin

[app:proxy-server]
use = egg:swift#proxy
allow_account_management = true
account_autocreate = true
# --- File ends here ---

# Restart servers and Proxy
swift-init account restart
swift-init container restart
swift-init object restart
swift-init proxy restart
\end{minted}
\item Managing container and object using \texttt{swift} command

Set following environmental variables
\begin{minted}[]{sh}
# --- ~/.profile ---
export ST_AUTH=http://192.168.8.80:8080/auth/v1.0
export ST_USER=wasteland:psachin
export ST_KEY=psachin
# --- File ends here ---
\end{minted}

Source the file before executing any command
\begin{minted}[]{sh}
source ~/.profile
\end{minted}

\emph{Most of the time, no configuration is needed, if Swift is
enabled during packstack. You can actually start from here.}
\begin{minted}[]{sh}
# --- Create container: 'keys' ---
swift post keys
# Verify/list containers
swift list
# --- Upload an object to container ---
# Create a file
echo "746c1c636cebe7a888fd77688dbfc252" > mykey.pem
# Upload object-'mykey.pem' to container-'keys'
swift upload keys mykey.pem
# Verify the object
swift list keys
# --- Download object ---
swift download keys mykey.pem
# Download object with different name
swift download keys mykey.pem -o mykey2.pem
\end{minted}

\begin{itemize}
\item Another way to access swift container/object is to provide
username \& password.
\begin{minted}[]{sh}
# swift -U <ACCOUNT>:<USER> -K <PASSWORD> COMMAND
swift -U wasteland:psachin -K psachin stat -v
#                     StorageURL: http://saio:8080/v1/AUTH_wasteland
#                     Auth Token: AUTH_tkf551ef98eb1e442b9efcef1261d87c64
#                        Account: AUTH_wasteland
#                     Containers: 1
#                        Objects: 0
#                          Bytes: 0
# Containers in policy "default": 1
#    Objects in policy "default": 0
#      Bytes in policy "default": 0
#                  Accept-Ranges: bytes
#                    X-Timestamp: 1463292608.77517
#                     X-Trans-Id: txc8bc7ba0659b497fb170f-00573b0ff4
#                   Content-Type: text/plain; charset=utf-8

# Upload an object
# swift -U <PASSWORD>:<PASSWORD> -K <PASSWORD> upload <CONTAINER> <file/object>
swift -U wasteland:psachin -K psachin upload keys mykey.pem
\end{minted}
\end{itemize}
\item Managing container and object using APIs(\texttt{curl} command)
\begin{minted}[]{sh}
# --- Get token ---
# Set authURL and publicURL
export authURL="http://192.168.8.80:8080/auth/v1.0/"
export publicURL="http://192.168.8.80:8080/v1/AUTH_wasteland"

curl -v \
	 -H "X-Auth-User: wasteland:psachin" \
	 -H "X-Auth-Key: psachin" \
	 $authURL

# *   Trying 192.168.8.80...
# * Connected to 192.168.8.80 (192.168.8.80) port 8080 (#0)
# > GET /auth/v1.0/ HTTP/1.1
# > Host: 192.168.8.80:8080
# > User-Agent: curl/7.43.0
# > Accept: */*
# > X-Auth-User: wasteland:psachin
# > X-Auth-Key: psachin
# >
# < HTTP/1.1 200 OK
# < X-Storage-Url: http://192.168.8.80:8080/v1/AUTH_wasteland
# < X-Auth-Token-Expires: 82975
# < X-Auth-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# < Content-Type: text/html; charset=UTF-8
# < X-Storage-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# < Content-Length: 0
# < X-Trans-Id: tx9c1bef9065754dd9b68ec-005735c49d
# < Date: Fri, 13 May 2016 12:12:13 GMT
# <
# * Connection #0 to host 192.168.8.80 left intact

export token="AUTH_tk968b0ae7947640be874af6cd897a2b1e"

# Verify account access
curl -v \
	 -H "X-Storage-Token: $token" \
	 $publicURL

# *   Trying 192.168.8.80...
# * Connected to 192.168.8.80 (192.168.8.80) port 8080 (#0)
# > GET /v1/AUTH_wasteland HTTP/1.1
# > Host: 192.168.8.80:8080
# > User-Agent: curl/7.43.0
# > Accept: */*
# > X-Storage-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# >
# < HTTP/1.1 204 No Content
# < Content-Length: 0
# < Accept-Ranges: bytes
# < X-Account-Object-Count: 0
# < X-Account-Storage-Policy-Default-Bytes-Used: 0
# < X-Account-Storage-Policy-Default-Object-Count: 0
# < X-Timestamp: 1463138224.81309
# < X-Account-Bytes-Used: 0
# < X-Account-Container-Count: 0
# < Content-Type: text/plain; charset=utf-8
# < X-Account-Storage-Policy-Default-Container-Count: 0
# < X-Trans-Id: tx95142c218202459399c88-005735cac1
# < Date: Fri, 13 May 2016 12:38:25 GMT
# <
# * Connection #0 to host 192.168.8.80 left intact

# --- Create a container: 'keys' ---
curl -v \
	 -H "X-Storage-Token: $token" \
	 -X PUT $publicURL/keys

# *   Trying 192.168.8.80...
# * Connected to 192.168.8.80 (192.168.8.80) port 8080 (#0)
# > PUT /v1/AUTH_wasteland/keys HTTP/1.1
# > Host: 192.168.8.80:8080
# > User-Agent: curl/7.43.0
# > Accept: */*
# > X-Storage-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# >
# < HTTP/1.1 201 Created
# < Content-Length: 0
# < Content-Type: text/html; charset=UTF-8
# < X-Trans-Id: tx39b7aee463b64127adfe2-005735cb92
# < Date: Fri, 13 May 2016 12:41:54 GMT
# <
# * Connection #0 to host 192.168.8.80 left intact

# Verify container
curl -v \
	 -H "X-Storage-Token: $token" \
	 -X GET $publicURL/keys

# *   Trying 192.168.8.80...
# * Connected to 192.168.8.80 (192.168.8.80) port 8080 (#0)
# > GET /v1/AUTH_wasteland/keys HTTP/1.1
# > Host: 192.168.8.80:8080
# > User-Agent: curl/7.43.0
# > Accept: */*
# > X-Storage-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# >
# < HTTP/1.1 204 No Content
# < Content-Length: 0
# < X-Container-Object-Count: 0
# < Accept-Ranges: bytes
# < X-Storage-Policy: default
# < X-Container-Bytes-Used: 0
# < X-Timestamp: 1463138224.83257
# < Content-Type: text/html; charset=UTF-8
# < X-Trans-Id: tx05408e3d41c246ea930f5-005735cc21
# < Date: Fri, 13 May 2016 12:44:17 GMT
# <
# * Connection #0 to host 192.168.8.80 left intact

# --- Upload object to container ---
# Create a file
echo "746c1c636cebe7a888fd77688dbfc252" > mykey.pem

# Upload object-'mykey.pem' to container-'keys'
curl -v \
	 -H "X-Storage-Token: $token" \
	 -X PUT $publicURL/keys/mykey.pem -T mykey.pem

# *   Trying 192.168.8.80...
# * Connected to 192.168.8.80 (192.168.8.80) port 8080 (#0)
# > PUT /v1/AUTH_wasteland/keys/mykey.pem HTTP/1.1
# > Host: 192.168.8.80:8080
# > User-Agent: curl/7.43.0
# > Accept: */*
# > X-Storage-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# > Content-Length: 43
# > Expect: 100-continue
# >
# < HTTP/1.1 100 Continue
# * We are completely uploaded and fine
# < HTTP/1.1 201 Created
# < Last-Modified: Fri, 13 May 2016 12:53:00 GMT
# < Content-Length: 0
# < Etag: 640ebd176639fb6ef9a3227770ee7b17
# < Content-Type: text/html; charset=UTF-8
# < X-Trans-Id: txf33923d6fbfe4523b4451-005735ce2b
# < Date: Fri, 13 May 2016 12:52:59 GMT
# <
# * Connection #0 to host 192.168.8.80 left intact

# Download an object
curl -v \
	 -H "X-Storage-Token: $token" \
	 -X GET $publicURL/keys/mykey.pem > mykey.pem

# *   Trying 192.168.8.80...
#   % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
#                                  Dload  Upload   Total   Spent    Left  Speed
	#   0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:-- 0* \
#                          Connected to 192.168.8.80 (192.168.8.80) port 8080 (#0)
# > GET /v1/AUTH_wasteland/keys/mykey.pem HTTP/1.1
# > Host: 192.168.8.80:8080
# > User-Agent: curl/7.43.0
# > Accept: */*
# > X-Storage-Token: AUTH_tk968b0ae7947640be874af6cd897a2b1e
# >
# < HTTP/1.1 200 OK
# < Content-Length: 43
# < Accept-Ranges: bytes
# < Last-Modified: Fri, 13 May 2016 12:53:00 GMT
# < Etag: 640ebd176639fb6ef9a3227770ee7b17
# < X-Timestamp: 1463143979.89953
# < Content-Type: application/octet-stream
# < X-Trans-Id: tx6b14a272331b4bc6937db-005735cef1
# < Date: Fri, 13 May 2016 12:56:17 GMT
# <
# { [43 bytes data]
# 100    43  100    43    0     0   2748      0 --:--:-- --:--:-- --:--:--  2866
# * Connection #0 to host 192.168.8.80 left intact
\end{minted}

\item Get statistics
\begin{minted}[]{sh}
# Auth related information
swift auth
# export OS_STORAGE_URL=http://192.168.8.80:8080/v1/AUTH_wasteland
# export OS_AUTH_TOKEN=AUTH_tkf551ef98eb1e442b9efcef1261d87c64

swift auth -v
# export ST_AUTH=http://192.168.8.80:8080/auth/v1.0
# export ST_USER=wasteland:psachin
# export ST_KEY=psachin

# To obtain Storage URL and Auth-Token
swift stat -v

# Get statistics of container and/or object
swift stat [container]
swift stat [container] [object]

# Retrive capability of proxy
swift capabilities
# Core: swift
#  Options:
#   account_autocreate: True
#   account_listing_limit: 10000
#   allow_account_management: True
#   container_listing_limit: 10000
#   extra_header_count: 0
#   max_account_name_length: 256
#   max_container_name_length: 256
#   max_file_size: 5368709122
#   max_header_size: 8192
#   max_meta_count: 90
#   max_meta_name_length: 128
#   max_meta_overall_size: 4096
#   max_meta_value_length: 256
#   max_object_name_length: 1024
#   policies: [{u'default': True, u'name': u'default', u'aliases': u'default'}]
#   strict_cors_mode: True
#   version: 2.7.1.dev83
# Additional middleware: bulk_delete
#  Options:
#   max_deletes_per_request: 10000
#   max_failed_deletes: 1000
# Additional middleware: bulk_upload
#  Options:
#   max_containers_per_extraction: 10000
#   max_failed_extractions: 1000
# Additional middleware: container_sync
#  Options:
#   realms: {u'TEST': {u'clusters': {u'SAIO': {u'current': True}}}}
# Additional middleware: slo
#  Options:
#   max_manifest_segments: 1000
#   max_manifest_size: 2097152
#   min_segment_size: 1
# Additional middleware: staticweb
# Additional middleware: tempauth
#  Options:
#   account_acls: True
# Additional middleware: tempurl
#  Options:
#   incoming_allow_headers: []
#   incoming_remove_headers: [u'x-timestamp']
#   methods: [u'GET', u'HEAD', u'PUT', u'POST', u'DELETE']
#   outgoing_allow_headers: [u'x-object-meta-public-*']
#   outgoing_remove_headers: [u'x-object-meta-*']

# List container's details(Similar to `ls -lh`)
swift list --lh [container]
\end{minted}

\item Object versioning

When an object is overwritten, it's older version is lost, but
there is a way we can store older version(s) of an object, no
matter how many times is was overwritten.

To enable object versioning, set \texttt{allow\_versions} option to
\texttt{true} in container configuration file.
\begin{minted}[]{sh}
# --- /etc/swift/container-server.conf ---
[app:container-server]
allow_versions = true
# --- File ends here ---

# --- Create containers ---
# Create 'archive' container to hold 'current' container's object versions
swift post archive

# Now create 'current' container with header 'X-Versions-Location'
# pointing to 'archive'
swift post current -H "X-Versions-Location: archive"

# --- Other similar ways(Optional) ---
# May also define content length at the time of creating a container
swift post archive -H "content-length: 0"
swift post current -H "content-length: 0" -H "X-Versions-Location: archive"

# And also specify Read ACL(World readable) during container creation
swift post -r ".r:*" archive -H "content-length: 0"
swift post -r ".r:*" current -H "content-length: 0" -H "X-Versions-Location: archive"
# --- xxx ---
\end{minted}

\item Managing container's quota
\begin{minted}[]{sh}
# Limit maximum of 2 objects in container 'keys'
swift post -H "X-Container-Meta-Quota-Count: 2" keys

# Max size of an object should be not more than 512 bytes in container 'keys'
swift post -H "X-Container-Meta-Quota-Bytes: 512" keys
\end{minted}

\vskip30ex
\end{itemize}
