2016/scripts/notes.org
** Builder files
   - Acts as a database
   - Python pickle
	 #+BEGIN_SRC python -n
       import pickle
       print(pickle.load(open('object.builder')))
	 #+END_SRC
   - Ring builder command
	 #+BEGIN_SRC sh
     # Account server runs on port 6002
     swift-ring-builder add account.builder <region><zone>-<IP>:6002/<device><weight>
     # Container server runs on port 6001
     swift-ring-builder add container.builder <region><zone>-<IP>:6001/<device><weight>
     # and the Object server runs on port 6000
     swift-ring-builder add object.builder <region><zone>-<IP>:6000/<device><weight>
     swift-ring-builder add object-N.builder <region><zone>-<IP>:6000/<device><weight>
	 #+END_SRC
   - Region: Geographical location
   - Zone: within region isolation
   - Weight: Relative number of partition a drive will have
	 - 1TB ~ Weight of 100.0
	 - 2TB ~ Weight of 200.0..
** Swift Ring
   - Data structure
   - Describes your cluster
   - One ring each for =account=, =container=, & =object=
     #+BEGIN_SRC sh
       # swift-ring-builder account.builder create <PartitionPower> <Replicas> <MinPartHrs>

       cd /etc/swift/
       swift-ring-builder account.builder create 10 3 1
       swift-ring-builder container.builder create 10 3 1
       swift-ring-builder object.builder create 10 3 1
     #+END_SRC

   - How to decide value of Partition Power?

     Assume that I have a system with 4 drives right now, but the
     maximum drives I can go up-to is 10.
     #+BEGIN_SRC sh
       # Partition Power
       2^part_power > (Nos. of drives you think you will have at-scale) * 100

       # I may have 10 drives in future
       2^part_power > 10 * 100
       2^part_power > 1000
       2^10 > 1000
       1024 > 1000  # 2^10 = 1024 just goes above 1000, which is perfect.
     #+END_SRC

   - Calculate Partition Power(Python snippet)
     #+BEGIN_SRC python -n
       # Use python3 interpreter
       from math import log2, ceil
       print(ceil(log2(10 * 100)))  # 10 <- Partition Power
     #+END_SRC

** Additional notes
   /Swift/ consistency processes:
   - /Auditor/: Will walk through the storage nodes, read the data and
     the checksum, ensure the checksum matched with the database
     checksum. If the checksum didn't match, the data is moved to the
     Quarantine.
   - /Replicator/: The replicator, will also scan each drive and
     ensures that the replicas of data is stored where is supposed to
     live. If it does not finds the data in that place(may be the
     data, due to corruption was moved to Quarantine), it will push
     the data to that place.

** Slides notes
- Multiple HDD, where is my data store?
- HDD failure
- Storage problem

- Ownership of your data
- Access to data, HTTP, FTP, ReST
  - Mobile, Laptop..

- Swift
  - loosely tied to storage media
  - Scalable
  - Direct client access


- Terminology
  - Proxy: provides API access/ Coordinates requests to storage
    servers
  - Account: user namespace
  - Container: User defined segment of an account(root directory)
  - Object: Actual data

- Flow
  Proxy request -> Storage nodes(account, container, obj)

- Data placement
  - triple replication by default(as unique as possible)
  - Show Region/Zone pic

- Drive failures
  1. Umount failing drive
  2. Replicate/rebalance data

- Server failures
  1. Network, Power
  2. New data that is to be written will be placed elsewhere within a
     cluster/server
  3. Rebalancing happens

- Currupt data
  1. Stores checksum of the data with data itself
  2. Matches checksum of data periodically
     - If checksum doesnt match, the object is quarantined and the
       replication process rebalances the data/object

- Storage policies
  - Decide where you want to store data
    - Between swift clusters
    - Subset of hardware
  - Erasure coding <- Data availability policies
    - Based in frequency of access

- Erasure Codes
  - [[https://www.youtube.com/watch?v=kH3DXMKlEr8]]
  - [[https://www.youtube.com/watch?v=GDNK1S4FJBQ]]

- ACLs
  - Container ACL
    #+BEGIN_SRC sh
      # World readable
      swift post -r ".r:*" photos

      # Allow .welcome.com but deny .noisy.com
      swift post -r ".r:*.welcome.com,.r:-noisy.com" photos

      # Enable object listing within a container
      swift post -r ".r:*,.rlistings" photos
    #+END_SRC

    \vskip20ex

- Hashing
  - Swift hashing function
    #+BEGIN_SRC python -n
      # Use python3 interpreter
      # Swift hashing is based on MD5
      # hash(path) = md5(path + per-cluster suffix)

      # Python snippet to know on which drive the object will be stored,
      # assuming I have 4 drives
      from hashlib import md5

      m = md5()
      m.update("/account/container/object")  # Hypothetical path
      digest = m.hexdigest()
      print(digest)

      # hex to int
      hex2int = int(digest, 16)
      print(hex2int)
      # digest % (number of drives) = Drive number
      print(hex2int % 4)  # 2
    #+END_SRC

** Swift handoff partitions
   - How is a handoff partition flagged versus a partition that is
     marked to be moved during a rebalance?

	 /Answer/ (notmyname): "handoff" is only a thing defined by the
     results of the call to =get_more_nodes()=. it's not a concept
     that means anything with regards to rebalancing. ie it's not
     "flagged" or anything. handoffs are just an ordered walk through
     the ring


   - How should one think of handoff devices?

     /Answer/ (mattoliverau): A hand off device is a non primary node
     for a certain partition in the ring. Things are placed to hand
     off nodes when either

	 - there wasn't enough primary nodes to keep it durable.
     - when write affinity has been set and you want to get your
       object durability written to a closer region or zone
     - on a ring rebalance

     When looking for an object (GET) swift will check all primary
     nodes for the object and then some of the hand off nodes.

     But in essence once on a handoff node, we have durability which
     is the most important. but if the primaries are busy or down you
     may not get your object back until swift corrects it self

     The replicators will look at the objects they have, and if its a
     partition they're a hand off for, becuase they received it cause
     other primaries where down, or a rebalance suddenly has now
     suddenly made them a handoff node for a partition, they will
     replicate it out to the primary nodes and then if successful,
     delete it.

     handoff nodes + eventual consistancy helps swift keep its awesome
     durability


   - is it (handoff node) meant to be a temporary holding place?

     /Answer/ (mattoliverau): Yeah

** Links
   - [[https://gitlab.cee.redhat.com/psachin/bootcamp]]
   - HTML version of this\footnote[1]{Made with Love, \LaTeX, \& GNU Emacs} doc is available at: \newline
     https://gitlab.cee.redhat.com/psachin/bootcamp/blob/master/2016/scripts/notes.org
   - Slides: [[https://redhat.slides.com/psachin/rhosp-swift-2016]]
