2016/scripts/notes.tex

\section{Builder files}
\label{sec:orgheadline3}
\begin{itemize}
\item Acts as a database
\item Python pickle
\begin{minted}[linenos,firstnumber=1]{python}
import pickle
print(pickle.load(open('object.builder')))
\end{minted}
\item Ring builder command
\begin{minted}[]{sh}
# Account server runs on port 6002
swift-ring-builder add account.builder <region><zone>-<IP>:6002/<device><weight>
# Container server runs on port 6001
swift-ring-builder add container.builder <region><zone>-<IP>:6001/<device><weight>
# and the Object server runs on port 6000
swift-ring-builder add object.builder <region><zone>-<IP>:6000/<device><weight>
swift-ring-builder add object-N.builder <region><zone>-<IP>:6000/<device><weight>
\end{minted}
\item Region: Geographical location
\item Zone: within region isolation
\item Weight: Relative number of partition a drive will have
\begin{itemize}
\item 1TB \textasciitilde{} Weight of 100.0
\item 2TB \textasciitilde{} Weight of 200.0..
\end{itemize}
\end{itemize}
\section{Swift Ring}
\label{sec:orgheadline4}
\begin{itemize}
\item Data structure
\item Describes your cluster
\item One ring each for \texttt{account}, \texttt{container}, \& \texttt{object}
\begin{minted}[]{sh}
# swift-ring-builder account.builder create <PartitionPower> <Replicas> <MinPartHrs>

cd /etc/swift/
swift-ring-builder account.builder create 10 3 1
swift-ring-builder container.builder create 10 3 1
swift-ring-builder object.builder create 10 3 1
\end{minted}

\item How to decide value of Partition Power?

Assume that I have a system with 4 drives right now, but the
maximum drives I can go up-to is 10.
\begin{minted}[]{sh}
# Partition Power
2^part_power > (Nos. of drives you think you will have at-scale) * 100

# I may have 10 drives in future
2^part_power > 10 * 100
2^part_power > 1000
2^10 > 1000
1024 > 1000  # 2^10 = 1024 just goes above 1000, which is perfect.
\end{minted}

\item Calculate Partition Power(Python snippet)
\begin{minted}[linenos,firstnumber=1]{python}
# Use python3 interpreter
from math import log2, ceil
print(ceil(log2(10 * 100)))  # 10 <- Partition Power
\end{minted}
\end{itemize}

\section{Additional notes}
\label{sec:orgheadline5}
\emph{Swift} consistency processes:
\begin{itemize}
\item \emph{Auditor}: Will walk through the storage nodes, read the data and
the checksum, ensure the checksum matched with the database
checksum. If the checksum didn't match, the data is moved to the
Quarantine.
\item \emph{Replicator}: The replicator, will also scan each drive and
ensures that the replicas of data is stored where is supposed to
live. If it does not finds the data in that place(may be the
data, due to corruption was moved to Quarantine), it will push
the data to that place.
\end{itemize}

\section{Slides notes}
\label{sec:orgheadline6}
\begin{itemize}
\item Multiple HDD, where is my data store?
\item HDD failure
\item Storage problem

\item Ownership of your data
\item Access to data, HTTP, FTP, ReST
\begin{itemize}
\item Mobile, Laptop..
\end{itemize}

\item Swift
\begin{itemize}
\item loosely tied to storage media
\item Scalable
\item Direct client access
\end{itemize}
\end{itemize}


\begin{itemize}
\item Terminology
\begin{itemize}
\item Proxy: provides API access/ Coordinates requests to storage
servers
\item Account: user namespace
\item Container: User defined segment of an account(root directory)
\item Object: Actual data
\end{itemize}

\item Flow
Proxy request -> Storage nodes(account, container, obj)

\item Data placement
\begin{itemize}
\item triple replication by default(as unique as possible)
\item Show Region/Zone pic
\end{itemize}

\item Drive failures
\begin{enumerate}
\item Umount failing drive
\item Replicate/rebalance data
\end{enumerate}

\item Server failures
\begin{enumerate}
\item Network, Power
\item New data that is to be written will be placed elsewhere within a
cluster/server
\item Rebalancing happens
\end{enumerate}

\item Currupt data
\begin{enumerate}
\item Stores checksum of the data with data itself
\item Matches checksum of data periodically
\begin{itemize}
\item If checksum doesnt match, the object is quarantined and the
replication process rebalances the data/object
\end{itemize}
\end{enumerate}

\item Storage policies
\begin{itemize}
\item Decide where you want to store data
\begin{itemize}
\item Between swift clusters
\item Subset of hardware
\end{itemize}
\item Erasure coding <- Data availability policies
\begin{itemize}
\item Based in frequency of access
\end{itemize}
\end{itemize}

\item Erasure Codes
\begin{itemize}
\item \url{https://www.youtube.com/watch?v=kH3DXMKlEr8}
\item \url{https://www.youtube.com/watch?v=GDNK1S4FJBQ}
\end{itemize}

\item ACLs
\begin{itemize}
\item Container ACL
\begin{minted}[]{sh}
# World readable
swift post -r ".r:*" photos

# Allow .welcome.com but deny .noisy.com
swift post -r ".r:*.welcome.com,.r:-noisy.com" photos

# Enable object listing within a container
swift post -r ".r:*,.rlistings" photos
\end{minted}

\vskip20ex
\end{itemize}

\item Hashing
\begin{itemize}
\item Swift hashing function
\begin{minted}[linenos,firstnumber=1]{python}
# Use python3 interpreter
# Swift hashing is based on MD5
# hash(path) = md5(path + per-cluster suffix)

# Python snippet to know on which drive the object will be stored,
# assuming I have 4 drives
from hashlib import md5

m = md5()
m.update("/account/container/object")  # Hypothetical path
digest = m.hexdigest()
print(digest)

# hex to int
hex2int = int(digest, 16)
print(hex2int)
# digest % (number of drives) = Drive number
print(hex2int % 4)  # 2
\end{minted}
\end{itemize}
\end{itemize}

\section{Swift handoff partitions}
\label{sec:orgheadline7}
\begin{itemize}
\item How is a handoff partition flagged versus a partition that is
marked to be moved during a rebalance?

\emph{Answer} (notmyname): "handoff" is only a thing defined by the
results of the call to \texttt{get\_more\_nodes()}. it's not a concept
that means anything with regards to rebalancing. ie it's not
"flagged" or anything. handoffs are just an ordered walk through
the ring
\end{itemize}


\begin{itemize}
\item How should one think of handoff devices?

\emph{Answer} (mattoliverau): A hand off device is a non primary node
for a certain partition in the ring. Things are placed to hand
off nodes when either

\begin{itemize}
\item there wasn't enough primary nodes to keep it durable.
\item when write affinity has been set and you want to get your
object durability written to a closer region or zone
\item on a ring rebalance
\end{itemize}
When looking for an object (GET) swift will check all primary
nodes for the object and then some of the hand off nodes.

But in essence once on a handoff node, we have durability which
is the most important. but if the primaries are busy or down you
may not get your object back until swift corrects it self

The replicators will look at the objects they have, and if its a
partition they're a hand off for, becuase they received it cause
other primaries where down, or a rebalance suddenly has now
suddenly made them a handoff node for a partition, they will
replicate it out to the primary nodes and then if successful,
delete it.

handoff nodes + eventual consistancy helps swift keep its awesome
durability
\end{itemize}


\begin{itemize}
\item is it (handoff node) meant to be a temporary holding place?

\emph{Answer} (mattoliverau): Yeah
\end{itemize}

\section{Links}
\label{sec:orgheadline8}
\begin{itemize}
\item \url{https://gitlab.cee.redhat.com/psachin/bootcamp}
\item HTML version of this\footnote[1]{Made with Love, \LaTeX, \& GNU Emacs} doc is available at: \newline
     \url{https://gitlab.cee.redhat.com/psachin/bootcamp/blob/master/2016/scripts/notes.org}
\item Slides: \url{https://redhat.slides.com/psachin/rhosp-swift-2016}
\end{itemize}
\end{document}
